In [2]:
import pandas as pd 
import numpy as np

In [3]:
!pip install xlrd==1.2.0

Requirement already satisfied: xlrd==1.2.0 in /Users/amodpathirana/opt/anaconda3/lib/python3.7/site-packages (1.2.0)

In [4]:
pd.__version__

'1.3.5'

In [5]:
%pip install --upgrade pandas

Requirement already satisfied: pandas in /Users/amodpathirana/opt/anaconda3/lib/python3.7/site-packages (1.3.5)
Requirement already satisfied: numpy>=1.17.3 in /Users/amodpathirana/opt/anaconda3/lib/python3.7/site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2017.3 in /Users/amodpathirana/opt/anaconda3/lib/python3.7/site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/amodpathirana/opt/anaconda3/lib/python3.7/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /Users/amodpathirana/opt/anaconda3/lib/python3.7/site-packages (from python-dateutil>=2.7.3->pandas) (1.12.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
df =pd.read_excel("website_visitors.xlsx")

In [7]:
df.head()

,customer_id,date,age,gender,country,item purchased,value,monthly visits
0,1,2022-03-02 00:00:00,23,Male,US,2.0,258,234
1,2,2022-03-03 00:00:00,34,Female,India,5.0,645,567
2,3,2022-03-04 00:00:00,23,Male,NaN,2.0,258,123
3,4,2022-03-05 00:00:00,ERR,Male,UK,7.0,903,123
4,5,2021-03-23 00:00:00,23,Male,France,1.0,129,47

In [8]:
df.shape

(30, 8)

# Data quality checking

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     30 non-null     int64
 1   date            30 non-null     object
 2   age             27 non-null     object
 3   gender          29 non-null     object
 4   country         29 non-null     object
 5   item purchased  29 non-null     float64
 6   value           30 non-null     int64
 7   monthly visits  27 non-null     object
dtypes: float64(1), int64(2), object(5)
memory usage: 2.0+ KB

In [10]:
df['country'].unique()

array(['US', 'India', nan, 'UK', 'France', 'Bolivia', 'Sweden', 'USA',
       'Germany', 'Brazil', 'Chile', 'Saudi Arabia', 'Japan', 'Norway',
       'Spain', 'Nigeria', 'United Kingdom', 'Switzerland', 'Russia'],
      dtype=object)

In [11]:
df['country'].nunique()

18

In [12]:
df.isna().sum()

customer_id       0
date              0
age               3
gender            1
country           1
item purchased    1
value             0
monthly visits    3
dtype: int64

In [13]:
(df.isna().sum()*100)/len(df)

customer_id        0.000000
date               0.000000
age               10.000000
gender             3.333333
country            3.333333
item purchased     3.333333
value              0.000000
monthly visits    10.000000
dtype: float64

In [14]:
df[df.duplicated()]

Empty DataFrame
Columns: [customer_id, date, age, gender, country, item purchased, value, monthly visits]
Index: []

# Data cleaning and Preprocessing

In [15]:
df.head(20)

,customer_id,date,age,gender,country,item purchased,value,monthly visits
0,1,2022-03-02 00:00:00,23,Male,US,2.0,258,234
1,2,2022-03-03 00:00:00,34,Female,India,5.0,645,567
2,3,2022-03-04 00:00:00,23,Male,NaN,2.0,258,123
3,4,2022-03-05 00:00:00,ERR,Male,UK,7.0,903,123
4,5,2021-03-23 00:00:00,23,Male,France,1.0,129,47
5,6,2022-03-07 00:00:00,NaN,Male,Bolivia,9.0,1161,3
6,7,2022-03-08 00:00:00,27,Male,Sweden,2.0,258,557
7,8,2021-02-02 00:00:00,23,Male,USA,1.0,129,455
8,9,2022-03-10 00:00:00,29,Female,Germany,2.0,258,NaN
9,10,2022-03-11 00:00:00,21,Male,Germany,6.0,774,554
10,11,2022-03-12 00:00:00,NaN,Male,Brazil,5.0,645,397
11,12,2022-03-13 00:00:00,31,Female,USA,4.0,516,567
12,13,2022-03-14 00:00:00,32,Male,India,2.0,258,347
13,14,3-15-21,27,Male,Chile,3.0,387,NaN
14,15,2022-03-16 00:00:00,23,Female,Saudi Arabia,6.0,774,582
15,16,2022-03-17 00:00:00,26,Male,India,7.0,903,234
16,17,2022-03-18 00:00:00,29,Female,Chile,9.0,1161,ERR
17,18,2022-03-19 00:00:00,ERR,Male,Saudi Arabia,1.0,129,234
18,19,2022-03-20 00:00:00,35,Male,India,6.0,774,478
19,20,2022-03-21 00:00:00,38,Female,US,2.0,258,490

In [17]:
df=df.replace('ERR', np.nan)

In [18]:
df.head(20)

,customer_id,date,age,gender,country,item purchased,value,monthly visits
0,1,2022-03-02 00:00:00,23.0,Male,US,2.0,258,234.0
1,2,2022-03-03 00:00:00,34.0,Female,India,5.0,645,567.0
2,3,2022-03-04 00:00:00,23.0,Male,NaN,2.0,258,123.0
3,4,2022-03-05 00:00:00,NaN,Male,UK,7.0,903,123.0
4,5,2021-03-23 00:00:00,23.0,Male,France,1.0,129,47.0
5,6,2022-03-07 00:00:00,NaN,Male,Bolivia,9.0,1161,3.0
6,7,2022-03-08 00:00:00,27.0,Male,Sweden,2.0,258,557.0
7,8,2021-02-02 00:00:00,23.0,Male,USA,1.0,129,455.0
8,9,2022-03-10 00:00:00,29.0,Female,Germany,2.0,258,NaN
9,10,2022-03-11 00:00:00,21.0,Male,Germany,6.0,774,554.0
10,11,2022-03-12 00:00:00,NaN,Male,Brazil,5.0,645,397.0
11,12,2022-03-13 00:00:00,31.0,Female,USA,4.0,516,567.0
12,13,2022-03-14 00:00:00,32.0,Male,India,2.0,258,347.0
13,14,3-15-21,27.0,Male,Chile,3.0,387,NaN
14,15,2022-03-16 00:00:00,23.0,Female,Saudi Arabia,6.0,774,582.0
15,16,2022-03-17 00:00:00,26.0,Male,India,7.0,903,234.0
16,17,2022-03-18 00:00:00,29.0,Female,Chile,9.0,1161,NaN
17,18,2022-03-19 00:00:00,NaN,Male,Saudi Arabia,1.0,129,234.0
18,19,2022-03-20 00:00:00,35.0,Male,India,6.0,774,478.0
19,20,2022-03-21 00:00:00,38.0,Female,US,2.0,258,490.0

In [23]:
from sklearn.impute import SimpleImputer

imputer = SimpleImputer(missing_values=np.nan, strategy="mean")

df[['value', 'item purchased','monthly visits']] = imputer.fit_transform(df[['value', 'item purchased','monthly visits']])

In [24]:
df.head(20)

,customer_id,date,age,gender,country,item purchased,value,monthly visits
0,1,2022-03-02 00:00:00,23.0,Male,US,2.0,258.0,234.000000
1,2,2022-03-03 00:00:00,34.0,Female,India,5.0,645.0,567.000000
2,3,2022-03-04 00:00:00,23.0,Male,NaN,2.0,258.0,123.000000
3,4,2022-03-05 00:00:00,NaN,Male,UK,7.0,903.0,123.000000
4,5,2021-03-23 00:00:00,23.0,Male,France,1.0,129.0,47.000000
5,6,2022-03-07 00:00:00,NaN,Male,Bolivia,9.0,1161.0,3.000000
6,7,2022-03-08 00:00:00,27.0,Male,Sweden,2.0,258.0,557.000000
7,8,2021-02-02 00:00:00,23.0,Male,USA,1.0,129.0,455.000000
8,9,2022-03-10 00:00:00,29.0,Female,Germany,2.0,258.0,355.423077
9,10,2022-03-11 00:00:00,21.0,Male,Germany,6.0,774.0,554.000000
10,11,2022-03-12 00:00:00,NaN,Male,Brazil,5.0,645.0,397.000000
11,12,2022-03-13 00:00:00,31.0,Female,USA,4.0,516.0,567.000000
12,13,2022-03-14 00:00:00,32.0,Male,India,2.0,258.0,347.000000
13,14,3-15-21,27.0,Male,Chile,3.0,387.0,355.423077
14,15,2022-03-16 00:00:00,23.0,Female,Saudi Arabia,6.0,774.0,582.000000
15,16,2022-03-17 00:00:00,26.0,Male,India,7.0,903.0,234.000000
16,17,2022-03-18 00:00:00,29.0,Female,Chile,9.0,1161.0,355.423077
17,18,2022-03-19 00:00:00,NaN,Male,Saudi Arabia,1.0,129.0,234.000000
18,19,2022-03-20 00:00:00,35.0,Male,India,6.0,774.0,478.000000
19,20,2022-03-21 00:00:00,38.0,Female,US,2.0,258.0,490.000000

In [25]:
df.dropna(inplace=True)

In [26]:
df.head(20)

,customer_id,date,age,gender,country,item purchased,value,monthly visits
0,1,2022-03-02 00:00:00,23.0,Male,US,2.000000,258.0,234.000000
1,2,2022-03-03 00:00:00,34.0,Female,India,5.000000,645.0,567.000000
4,5,2021-03-23 00:00:00,23.0,Male,France,1.000000,129.0,47.000000
6,7,2022-03-08 00:00:00,27.0,Male,Sweden,2.000000,258.0,557.000000
7,8,2021-02-02 00:00:00,23.0,Male,USA,1.000000,129.0,455.000000
8,9,2022-03-10 00:00:00,29.0,Female,Germany,2.000000,258.0,355.423077
9,10,2022-03-11 00:00:00,21.0,Male,Germany,6.000000,774.0,554.000000
11,12,2022-03-13 00:00:00,31.0,Female,USA,4.000000,516.0,567.000000
12,13,2022-03-14 00:00:00,32.0,Male,India,2.000000,258.0,347.000000
13,14,3-15-21,27.0,Male,Chile,3.000000,387.0,355.423077
14,15,2022-03-16 00:00:00,23.0,Female,Saudi Arabia,6.000000,774.0,582.000000
15,16,2022-03-17 00:00:00,26.0,Male,India,7.000000,903.0,234.000000
16,17,2022-03-18 00:00:00,29.0,Female,Chile,9.000000,1161.0,355.423077
18,19,2022-03-20 00:00:00,35.0,Male,India,6.000000,774.0,478.000000
19,20,2022-03-21 00:00:00,38.0,Female,US,2.000000,258.0,490.000000
20,21,2022-03-22 00:00:00,41.0,Male,US,7.000000,903.0,234.000000
21,22,2022-03-23 00:00:00,44.0,Female,Japan,5.000000,645.0,234.000000
23,24,2022-03-25 00:00:00,23.0,Male,Norway,3.000000,387.0,678.000000
24,25,2022-03-26 00:00:00,21.0,Female,Spain,3.965517,67.0,355.423077
25,26,2022-03-27 00:00:00,26.0,Male,Chile,4.000000,516.0,109.000000

In [28]:
df["gender"]=df["gender"].str.strip()
df["country"]=df["country"].str.strip()

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 23 entries, 0 to 29
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     23 non-null     int64
 1   date            23 non-null     object
 2   age             23 non-null     float64
 3   gender          23 non-null     object
 4   country         23 non-null     object
 5   item purchased  23 non-null     float64
 6   value           23 non-null     float64
 7   monthly visits  23 non-null     float64
dtypes: float64(4), int64(1), object(3)
memory usage: 1.6+ KB

In [30]:
df['date']=pd.to_datetime(df['date'])

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 23 entries, 0 to 29
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   customer_id     23 non-null     int64
 1   date            23 non-null     datetime64[ns]
 2   age             23 non-null     float64
 3   gender          23 non-null     object
 4   country         23 non-null     object
 5   item purchased  23 non-null     float64
 6   value           23 non-null     float64
 7   monthly visits  23 non-null     float64
dtypes: datetime64[ns](1), float64(4), int64(1), object(2)
memory usage: 1.6+ KB

In [32]:
df.head()

,customer_id,date,age,gender,country,item purchased,value,monthly visits
0,1,2022-03-02,23.0,Male,US,2.0,258.0,234.0
1,2,2022-03-03,34.0,Female,India,5.0,645.0,567.0
4,5,2021-03-23,23.0,Male,France,1.0,129.0,47.0
6,7,2022-03-08,27.0,Male,Sweden,2.0,258.0,557.0
7,8,2021-02-02,23.0,Male,USA,1.0,129.0,455.0